Numpy

In [2]:
a = [1,2,3]
b = [2,3,4]

In [5]:
c = [2,'xiaowang']
c

[2, 'xiaowang']

In [2]:
[f*s for f, s in zip(a,b)]#打包

[2, 6, 12]

In [7]:
import numpy
a = numpy.array([1,2,3])#制作array
b = numpy.array([2,3,4])

In [8]:
a * b

array([ 2,  6, 12])

In [9]:
import numpy as np
#创建二维数组
na = np.array([['name', 'gender', 'age'], ['frank', 'M', 29], ['mary', 'F', 23], ['tom', 'M', 35], ['ted', 'M', 33], ['jean', 'F', 21], ['lisa', 'F', 20]])
na

array([['name', 'gender', 'age'],
       ['frank', 'M', '29'],
       ['mary', 'F', '23'],
       ['tom', 'M', '35'],
       ['ted', 'M', '33'],
       ['jean', 'F', '21'],
       ['lisa', 'F', '20']],
      dtype='<U6')

In [11]:
import pandas as pd
#创建dataframe
df = pd.DataFrame([['frank', 'M', 29], ['mary', 'F', 23], ['tom', 'M', 35], ['ted', 'M', 33], ['jean', 'F', 21], ['lisa', 'F', 20]])
df

       0  1   2
0  frank  M  29
1   mary  F  23
2    tom  M  35
3    ted  M  33
4   jean  F  21
5   lisa  F  20

In [14]:
import pandas as pd
#创建dataframe
df = pd.DataFrame([['name', 'gender', 'age'],['frank', 'M', 29], ['mary', 'F', 23], ['tom', 'M', 35], ['ted', 'M', 33], ['jean', 'F', 21], ['lisa', 'F', 20]])
df

       0       1    2
0   name  gender  age
1  frank       M   29
2   mary       F   23
3    tom       M   35
4    ted       M   33
5   jean       F   21
6   lisa       F   20

In [12]:
df.columns = ['name', 'gender', 'age']#给栏位命名

In [13]:
df

    name gender  age
0  frank      M   29
1   mary      F   23
2    tom      M   35
3    ted      M   33
4   jean      F   21
5   lisa      F   20

Series

In [15]:
import pandas as pd
#创建一个序列
phone = pd.Series([21000,18900,18000])
phone

0    21000
1    18900
2    18000
dtype: int64

In [17]:
?pd.Series

In [16]:
#命名了索引的序列
phone = pd.Series([21000,18900,18000], index = ['Iphone 7', 'Oppo', 'Moto'])
phone

Iphone 7    21000
Oppo        18900
Moto        18000
dtype: int64

In [11]:
#根据索引取序列的值
phone[1]

18900

In [12]:
#切片
phone[1:3]

Oppo    18900
Moto    18000
dtype: int64

In [13]:
phone['Oppo']

18900

DataFrame

In [18]:
#创建一个dataframe
import pandas as pd
df = pd.DataFrame([['frank', 'M', 29], ['mary', 'F', 23], ['tom', 'M', 35], ['ted', 'M', 33], ['jean', 'F', 21], ['lisa', 'F', 20]])
df

       0  1   2
0  frank  M  29
1   mary  F  23
2    tom  M  35
3    ted  M  33
4   jean  F  21
5   lisa  F  20

In [19]:
#给栏位重新命名
df.columns = ['name', 'gender', 'age']

In [20]:
df

    name gender  age
0  frank      M   29
1   mary      F   23
2    tom      M   35
3    ted      M   33
4   jean      F   21
5   lisa      F   20

In [17]:
#用列表方式创建dataframe
df = pd.DataFrame([['frank', 'M', 29],['mary', 'F', 23], ['tom', 'M', 35], ['ted', 'M', 33], ['jean', 'F', 21], ['lisa', 'F', 20]], columns = ['name', 'gender', 'age'])
df

    name gender  age
0  frank      M   29
1   mary      F   23
2    tom      M   35
3    ted      M   33
4   jean      F   21
5   lisa      F   20

In [21]:
#用字典方式创建dataframe
df = pd.DataFrame([{'name':'frank', 'gender':'M', 'age':29}, \
                   {'name':'mary',  'gender':'F', 'age':23, 'employee':True}, \
                   {'name':'tom',   'gender':'M', 'age':35}, \
                   {'name':'ted',   'gender':'M', 'age':33}, \
                   {'name':'jean',  'gender':'F', 'age':21}, \
                   {'name':'lisa',  'gender':'F', 'age':20}])
df

   age employee gender   name
0   29      NaN      M  frank
1   23     True      F   mary
2   35      NaN      M    tom
3   33      NaN      M    ted
4   21      NaN      F   jean
5   20      NaN      F   lisa

In [22]:
#按行显示前五条
df.head()

   age employee gender   name
0   29      NaN      M  frank
1   23     True      F   mary
2   35      NaN      M    tom
3   33      NaN      M    ted
4   21      NaN      F   jean

In [21]:
#可以指定条数
df.head(3)

   age employee gender   name
0   29      NaN      M  frank
1   23     True      F   mary
2   35      NaN      M    tom

In [20]:
#按行显示最后五条
df.tail()

   age employee gender  name
1   23     True      F  mary
2   35      NaN      M   tom
3   33      NaN      M   ted
4   21      NaN      F  jean
5   20      NaN      F  lisa

In [22]:
#显示最后一行
df.tail(1)

   age employee gender  name
5   20      NaN      F  lisa

In [23]:
#显示信息
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
age         6 non-null int64
employee    1 non-null object
gender      6 non-null object
name        6 non-null object
dtypes: int64(1), object(3)
memory usage: 272.0+ bytes

In [24]:
#显示描述性信息，std：标准差（Standard Deviation）
df.describe()

             age
count   6.000000
mean   26.833333
std     6.400521
min    20.000000
25%    21.500000
50%    26.000000
75%    32.000000
max    35.000000

In [25]:
#显示数据类型
df.dtypes

age          int64
employee    object
gender      object
name        object
dtype: object